<template>
  <div class="main-content-container container-fluid px-4">
    <!-- Page Header -->
    <div class="page-header row no-gutters py-4">
      <div class="col-12 col-sm-4 text-center text-sm-left mb-0">
        <span class="text-uppercase page-subtitle">Офферта</span>
        <h3 class="page-title">Договор публичной офферты</h3>
      </div>
    </div>
    <!-- Default -->
    <div class="row">
      <d-col class="md-12">
        <d-card class="mb-2">
          <div class="vuepdf">
            <div id="pdf">
              <div class="card-header">
                <h6 class="m-0 text-center">ПУБЛИЧНАЯ ОФЕРТА</h6>
              </div>
              <div class="card-body pb-3 text-center component-props">
                <p style="text-align: center;">
                  <strong>о предоставлении услуг по доступу к электронным сервисам</strong>
                </p>
                <p style="text-align: center;">
                  <strong>Ecomarine.kz</strong>
                </p>
                <p style="text-align: left;">
                  <strong>ТОО &laquo;EcoMarine Kazakhstan&raquo;</strong>, именуемое в
                  дальнейшем
                  &laquo;Оператор&raquo;, предлагает любому физическому или юридическому лицу, индивидуальному
                  предпринимателю в дальнейшем именуемому &laquo;Участник EcoMarine&raquo;, платные электронные услуги в
                  сети Интернет (далее &ndash; Услуги).
                </p>
                <p style="text-align: left;">
                  Настоящее предложение в соответствии со ст. 395 Гражданского Кодекса
                  Республики
                  Казахстан (далее &ndash; ГК РК) является публичной офертой,
                </p>
                <p style="text-align: left;">
                  полным и безоговорочным принятием (акцептом) условий которой в соответствии
                  со
                  ст. 396 ГК РК считается осуществление Участником конкурентных действий &ndash; путем произведения
                  действий
                  по регистрации на Портале Оператора, размещенному по адресу&nbsp;
                  <a
                    href="https://ecomarine.kz/"
                  >https://</a>
                  <a href="https://ecomarine.kz/">ecomarine.kz</a>&nbsp;и
                  подписанием &ldquo;Соглашения об использовании
                  EcoMarine&rdquo;, расположенного на Портале Оператора.
                </p>
                <p style="text-align: left;">
                  В соответствии со ст. 395, 396 ГК РК и Казахстан в случае принятия
                  изложенных
                  ниже условий, лицо , производящее акцепт этой оферты, становится Участником, а Оператор и Участник
                  совместно &mdash; Сторонами договора Оферты.
                </p>
                <p style="text-align: left;">
                  <strong>1. Основные термины и определения</strong>
                </p>
                <p style="text-align: left;">
                  <strong>1.1. EcoMarine&nbsp;- система</strong>
                  <strong>
                    управления
                    выбросами
                  </strong>
                  <strong>для бизнеса и граждан.</strong>
                </p>
                <p style="text-align: left;">
                  <strong>1.2. Электронные сервисы&nbsp;EcoMarine&nbsp;(ЭС)</strong>&nbsp;-
                  функционал Системы, позволяющий обеспечить возможность сбора, обработки, напоминания, расчетов, и
                  формирования отчетов в области охраны окружающей среды.
                </p>
                <p style="text-align: left;">
                  <strong>1.3. Акцепт</strong>&nbsp;- ответ лица, которому адресована оферта,
                  о
                  ее принятии.
                </p>
                <p style="text-align: left;">
                  <strong>1.4. Оферта</strong>&nbsp;- предложение о заключении договора,
                  сделанное одному или нескольким конкретным лицам, если оно достаточно определенно и выражает намерение
                  лица, сделавшего предложение, считать себя связанным в случае его принятия (акцепта).
                </p>
                <p style="text-align: left;">
                  <strong>1.5. Акцепт оферты</strong>&mdash; полное и безоговорочное принятие
                  условий оферты путем осуществления физическим и/или от имени юридического лица, индивидуального
                  предпринимателя действий регистрации Участника Портала и подписанием Соглашения об использовании
                  EcoMarine
                  (далее &ndash; Соглашение).
                </p>
                <p style="text-align: left;">
                  <strong>1.6. Публичная оферта</strong>&mdash; настоящий Договор между
                  Оператором и Участником на предоставление доступа к сервисам Портала EcoMarine , который заключается
                  посредством акцепта оферты.
                </p>
                <p style="text-align: left;">
                  <strong>1.7. Оператор&nbsp;EcoMarine&nbsp;</strong>(далее &ndash; Оператор)
                  -
                  ТОО &laquo;EcoMarine Kazakhstan&raquo;, лицо, владеющее EcoMarine и располагающее правом
                  распространения,
                  уполномоченное осуществлять размещение и обмен информации на Портале, в соответствии с настоящим
                  Договором, Правилами использования EcoMarine.
                </p>
                <p style="text-align: left;">
                  <strong>1.8. Участник</strong>
                  <strong>EcoMarine</strong>&nbsp;&ndash;
                  физическое, юридическое лицо, индивидуальный предприниматель или должностное лицо, участвующие в
                  процессах
                  сбора, обработки, хранения, передачи, поиска и распространения электронных документов с наделёнными
                  Удостоверяющим центром правами заявлять Владельцев регистрационного свидетельства.
                </p>
                <p style="text-align: left;">
                  <strong>1.9. Пользователь EcoMarine&nbsp;</strong>&ndash; любое физическое
                  лицо
                  и/или представитель юридического лица, филиала, представительства, индивидуальный предприниматель,
                  зарегистрировавшийся на EcoMarine с ролями, предусмотренными Порталом и/или пользующийся услугами
                  Портала,
                  уполномоченный Участником EcoMarine представлять его интересы на Портале и выступающий от имени
                  Участника
                  EcoMarine.
                </p>
                <p style="text-align: left;">
                  <strong>1.10. Правила использования EcoMarine</strong>&nbsp;&ndash;
                  настоящий
                  документ, устанавливающий условия, правила использования Электронного портала EcoMarine,
                  расположенного по
                  адресу&nbsp;
                  <a
                    href="https://ecomarine.kz/offer"
                  >https://</a>
                  <a href="https://ecomarine.kz/ru/pages/offer">ecomarine.kz/</a>&nbsp;, порядок работы в системе
                  управления
                  охраной окружающей среды.
                </p>
                <p style="text-align: left;">
                  <strong>1.11. ЭЦП&nbsp;</strong>&ndash; электронно-цифровая подпись,
                  выданная
                  Национальным Удостоверяющим центром Республики Казахстан, используемая для подписания и верификации,
                  юридической значимости действий Пользователя с Порталом.
                </p>
                <p style="text-align: left;">
                  <strong>1.12. Аутентификация&nbsp;</strong>&ndash; процедура подтверждения
                  подлинности личности пользователя посредством регистрационного свидетельства (сертификата)
                  Национального
                  удостоверяющего центра Республики Казахстан.
                </p>
                <p style="text-align: left;">
                  <strong>1.13. Регистрация на Портале&nbsp;</strong>&ndash; процедура
                  аутентификации участника и создания учетной записи Участника на портале посредством сертификата,
                  выданного
                  НУЦ РК.
                </p>
                <p style="text-align: left;">
                  <strong>1.14. Авторизация&nbsp;</strong>&ndash; процедура проверки прав
                  доступа
                  пользователя к EcoMarine или функциональному модулю EcoMarine.
                </p>
                <p style="text-align: left;">
                  <strong>1.15. Абонентская плата</strong>&ndash;денежные средства за
                  пользование
                  фиксированным объемом услуг Портала, оплачиваемые Оператору предоплатой за фиксированный период
                  времени.
                </p>
              </div>
            </div>
          </div>

          <d-card-footer>
            <div class="d-flex">
              <d-button v-on:click="pdfgen" class="btn ml-auto">Выгрузить PDF</d-button>
            </div>
          </d-card-footer>
        </d-card>
      </d-col>
    </div>
  </div>
</template>

<script>
/* eslint-disable */
export default {
  name: "Pdfgen",
  props: {
    msg: String
  },
  methods: {
    pdfgen: function() {
      var pdfMake = require("pdfmake/build/pdfmake.js");
      if (pdfMake.vfs == undefined) {
        var pdfFonts = require("pdfmake/build/vfs_fonts.js");
        pdfMake.vfs = pdfFonts.pdfMake.vfs;
      }
      var docDefinition = {
        content: [
          {
            text: "ПУБЛИЧНАЯ ОФЕРТА",
            style: "header",
            alignment: "center"
          },
          {
            text:
              "о предоставлении услуг по доступу к электронным сервисам Ecomarine.kz",
            style: "subheader",
            alignment: "center"
          },
          {
            alignment: "justify",
            text: [
              "ТОО «EcoMarine Kazakhstan», именуемое в дальнейшем «Оператор», предлагает любому физическому или юридическому лицу, индивидуальному предпринимателю в дальнейшем именуемому «Участник EcoMarine», платные электронные услуги в сети Интернет (далее – Услуги).\n\n"
            ]
          },
          {
            alignment: "justify",
            text: [
              "Настоящее предложение в соответствии со ст. 395 Гражданского Кодекса Республики Казахстан (далее – ГК РК) является публичной офертой \n\n"
            ]
          },
          {
            alignment: "justify",
            text: [
              "полным и безоговорочным принятием (акцептом) условий которой в соответствии со ст. 396 ГК РК считается осуществление Участником конкурентных действий – путем произведения действий по регистрации на Портале Оператора, размещенному по адресу https://ecomarine.kz и подписанием “Соглашения об использовании EcoMarine”, расположенного на Портале Оператора.\n\n"
            ]
          },
          {
            alignment: "justify",
            text: [
              "В соответствии со ст. 395, 396 ГК РК и Казахстан в случае принятия изложенных ниже условий, лицо , производящее акцепт этой оферты, становится Участником, а Оператор и Участник совместно — Сторонами договора Оферты.\n\n"
            ]
          },
          {
            text: "1. Основные термины и определения \n\n",
            style: "header"
          },
          {
            alignment: "justify",
            ul: [
              "1.1. EcoMarine - система управления выбросами для бизнеса и граждан.",
              "1.2. Электронные сервисы EcoMarine (ЭС) - функционал Системы, позволяющий обеспечить возможность сбора, обработки, напоминания, расчетов, и формирования отчетов в области охраны окружающей среды.",
              "1.3. Акцепт - ответ лица, которому адресована оферта, о ее принятии.",
              "1.4. Оферта - предложение о заключении договора, сделанное одному или нескольким конкретным лицам, если оно достаточно определенно и выражает намерение лица, сделавшего предложение, считать себя связанным в случае его принятия (акцепта).",
              "1.5. Акцепт оферты— полное и безоговорочное принятие условий оферты путем осуществления физическим и/или от имени юридического лица, индивидуального предпринимателя действий регистрации Участника Портала и подписанием Соглашения об использовании EcoMarine (далее – Соглашение).",
              "1.6. Публичная оферта— настоящий Договор между Оператором и Участником на предоставление доступа к сервисам Портала EcoMarine , который заключается посредством акцепта оферты.",
              "1.7. Оператор EcoMarine (далее – Оператор) - ТОО «EcoMarine Kazakhstan», лицо, владеющее EcoMarine и располагающее правом распространения, уполномоченное осуществлять размещение и обмен информации на Портале, в соответствии с настоящим Договором, Правилами использования EcoMarine.",
              "1.8. Участник EcoMarine – физическое, юридическое лицо, индивидуальный предприниматель или должностное лицо, участвующие в процессах сбора, обработки, хранения, передачи, поиска и распространения электронных документов с наделёнными Удостоверяющим центром правами заявлять Владельцев регистрационного свидетельства.",
              "1.9. Пользователь EcoMarine – любое физическое лицо и/или представитель юридического лица, филиала, представительства, индивидуальный предприниматель, зарегистрировавшийся на EcoMarine с ролями, предусмотренными Порталом и/или пользующийся услугами Портала, уполномоченный Участником EcoMarine представлять его интересы на Портале и выступающий от имени Участника EcoMarine.",
              "1.10. Правила использования EcoMarine – настоящий документ, устанавливающий условия, правила использования Электронного портала EcoMarine, расположенного по адресу https://ecomarine.kz/ , порядок работы в системе управления охраной окружающей среды.",
              "1.11. ЭЦП – электронно-цифровая подпись, выданная Национальным Удостоверяющим центром Республики Казахстан, используемая для подписания и верификации, юридической значимости действий Пользователя с Порталом.",
              "1.12. Аутентификация – процедура подтверждения подлинности личности пользователя посредством регистрационного свидетельства (сертификата) Национального удостоверяющего центра Республики Казахстан.",
              "1.13. Регистрация на Портале – процедура аутентификации участника и создания учетной записи Участника на портале посредством сертификата, выданного НУЦ РК.",
              "1.14. Авторизация – процедура проверки прав доступа пользователя к EcoMarine или функциональному модулю EcoMarine.",
              "1.15. Абонентская плата–денежные средства за пользование фиксированным объемом услуг Портала, оплачиваемые Оператору предоплатой за фиксированный период времени."
            ]
          }
        ],
        styles: {
          header: {
            fontSize: 18,
            bold: true
          },
          subheader: {
            fontSize: 15,
            bold: true
          },
          quote: {
            italics: true
          },
          small: {
            fontSize: 8
          }
        }
      };
      pdfMake.createPdf(docDefinition).download("offertaEcoMarine.pdf");
    }
  }
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
h3 {
  margin: 40px 0 0;
}
ul {
  list-style-type: none;
  padding: 0;
}
li {
  display: inline-block;
  margin: 0 10px;
}
a {
  color: #42b983;
}
</style>